backend/controllers/BrandController.php

SELECT COUNT(*) FROM (SELECT * FROM `brand` WHERE `status` != '-1' ORDER BY `sort`) `c`
SELECT * FROM `brand` WHERE `status` != '-1' ORDER BY `sort` LIMIT 3
---
    public function actionIndex()
    {
        //分页 总条数 每页显示条数 当前第几页

//        $query=Brand::find()->where(["status"=>[1,0]]);  ->orderBy('sort desc')
        $query=Brand::find()->where(['!=','status','-1']) ->orderBy('sort');
        //总条数
        $total = $query->count();
        //每页显示条数 3
        $perPage = 3;
        // 初始化分页
        $pager=new Pagination([
            'totalCount'=>$total,
            'defaultPageSize'=>$perPage,
        ]);
        //查询所有的品牌数据
        $brands=$query->limit($pager->limit)->offset($pager->offset)->all();