backend/controllers/GoodsController.php

SELECT COUNT(*) FROM `goods` WHERE `status`=1
SELECT * FROM `goods` WHERE `status`=1 LIMIT 2 OFFSET 2
---
    public function actionIndex()
    {
        //实例化搜索表单模型
        $model = new SearchForm();
        //只显示状态为1的商品
        $query = Goods::find()->where(['status'=>1]);
        //实例化提交方式
        $request = new Request();
        //判断是否是get方式提交
        if($request->isGet){
            //接受并验证
            if($model->load($request->get()) && $model->validate()){
                //调用search方法
                $model->search($query);
            }
        }
        //实例化分页组件
        $pager = new Pagination([
            //查询出数据库所有条数
            'totalCount'=>$query->count(),
            //指定每页显示几条
            'pageSize'=>2,
        ]);
        //查询出数据
        $models = $query->limit($pager->limit)->offset($pager->offset)->all();

SELECT COUNT(*) FROM `goods_day_count` WHERE `day`='2017-07-24'
SELECT * FROM `goods_day_count` WHERE `day`='2017-07-24'
UPDATE `goods_day_count` SET `count`=4 WHERE `day`='2017-07-24'
SELECT `count` FROM `goods_day_count` WHERE `day`='2017-07-24'
---
    public function actionAdd(){
        $model=new Goods();
        $detail = new GoodsIntro();

        if($model->load(\Yii::$app->request->post())&& $detail->load(\Yii::$app->request->post())&& $model->validate()&& $detail->validate()) {

            $day = date('Y-m-d', time());
            //根据日期查询商品数量表，如果有记录就+1  没有就新增一条
            if (GoodsDayCount::find()->select('*')->where(['day' => $day])->count() == 0) {
                //添加新纪录
                $day_count = new GoodsDayCount();
                $day_count->day = $day;
                $day_count->count = 1;
                $day_count->save();
            } else {
                //修改记录+1
                $count = GoodsDayCount::findOne(['day' => $day]);
                $count->count += 1;
                $count->save();
            }
            //添加时间
            $model->create_time = time();
            //添加货号（新增商品自动生成sn,规则为年月日+今天的第几个商品,比如2016053000001）
            //当前年月日
            $ydm = date('Ymd', time());//当前年月日
            //如果没有当天的记录，说明今天还没有添加过商品，创建一条记录，count设置为0；如果有记录，则获取该记录的count值。
            $sum = GoodsDayCount::find()->select(['count'])->where(['day' => date('Y-m-d', time())])->column()[0];

SELECT * FROM `goods_category`
---
            return $this->redirect(['goods/index']);
        }
        //查询出商品分类列表
        $categories = ArrayHelper::merge([['id' => 0, 'name' => '顶级分类', 'parent_id' => 0]], GoodsCategory::find()->asArray()->all());

SELECT * FROM `goods` WHERE `id`='6'
SELECT * FROM `goods_intro` WHERE `goods_id`='6'
SELECT * FROM `goods_category`
---
    public function actionEdit($id){
        //根据id查询数据将其修改
        $model = Goods::findOne(['id'=>$id]);
        $detail = GoodsIntro::findOne(['goods_id'=>$id]);
        //实例化提交方式
        $request = \Yii::$app->request;
        //判断是否post方式提交
        if($request->isPost){
            //加载数据
            $model->load($request->post());
            $detail->load($request->post());
            //验证数据
            if($model->validate() && $detail->validate()){
                //得到当前时间戳
                $model->create_time = time();
                //将数据进行保存
                if($model->save()){
                    $detail->save(false);
                }
                //添加成功跳转index页面,失败则打印错误信息
                \Yii::$app->session->setFlash('success','添加成功');
                return $this->redirect(['goods/index']);
            }else{
                var_dump($model->getErrors());exit;
            }
        }
        //查询出商品分类数据列表
        $categories = ArrayHelper::merge([['id'=>0,'name'=>'顶级分类','parent_id'=>0]],GoodsCategory::find()->asArray()->all());

SELECT * FROM `goods` WHERE `id`='6'
SELECT * FROM `goods_intro` WHERE `goods_id`='6'
---
    public function actionSel($id){
        //根据id显示相关商品的详情
        $model = Goods::findOne(['id'=>$id]);
        $detail = GoodsIntro::findOne(['goods_id'=>$id]);